const CHAR_SIZE = 16;//Размер символа в битах (кратно 8ми)
const BLOCK_SIZE64 = 64;//Размер блока 64 бита
const BLOCK_SIZE32 = 32;//Размер блока 32 бита
const ADD_MOD = 4294967296;//Для сложения по модулю 2^32
const S_BLOCKS = [
    [14,11,10,3,5,13,0,2,12,4,8,15,1,6,9,7],
    [0,6,11,10,9,5,13,2,7,1,4,12,3,15,8,14],
    [3,10,2,5,11,15,14,7,0,6,13,1,8,9,12,4],
    [4,10,15,12,8,2,11,7,3,0,13,1,14,5,6,9],
    [4,10,11,1,13,6,9,7,2,14,8,3,0,5,12,15],
    [10,9,15,3,0,2,7,8,12,13,11,5,14,6,4,1],
    [11,2,4,9,6,7,12,0,14,15,8,3,13,1,10,5],
    [0,10,5,4,6,13,11,9,14,1,2,12,7,8,15,3]
]
export {CHAR_SIZE, BLOCK_SIZE64, BLOCK_SIZE32, ADD_MOD, S_BLOCKS}